## Plan Result (sbox_ai - TerraformPlanApply)




<pre><code>Plan: 6 to add, 9 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.cognitive_account_primary_access_key
  * azurerm_key_vault_secret.cognitive_account_secondary_access_key
  * module.ai.azurerm_role_assignment.blob_reader_from_ai_foundry
  * module.ai.azurerm_role_assignment.blob_reader_from_ml_workspace
  * module.key_vault.azurerm_key_vault_access_policy.implicit_managed_identity_access_policy[0]
  * module.key_vault.azurerm_user_assigned_identity.managed_identity[0]
* Update
  * azurerm_resource_group.rg
  * module.ai.azurerm_ai_foundry.ai_foundry
  * module.ai.azurerm_cognitive_account.cognitive_account
  * module.ai.azurerm_machine_learning_workspace.ml_workspace
  * module.application_insights.azurerm_application_insights.this
  * module.application_insights.azurerm_monitor_activity_log_alert.main[0]
  * module.key_vault.azurerm_key_vault.kv
  * module.storage.azurerm_private_endpoint.this[0]
  * module.storage.azurerm_storage_account.storage_account




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.cognitive_account_primary_access_key will be created
  + resource "azurerm_key_vault_secret" "cognitive_account_primary_access_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.KeyVault/vaults/dlrm-ingest-ai-kv-sbox"
      + name                    = "cognitive-account-primary-access-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.cognitive_account_secondary_access_key will be created
  + resource "azurerm_key_vault_secret" "cognitive_account_secondary_access_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.KeyVault/vaults/dlrm-ingest-ai-kv-sbox"
      + name                    = "cognitive-account-secondary-access-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id         = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox"
        name       = "dlrm-ingest-ai-sbox"
      ~ tags       = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2025-04-08"
        } -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.ai.azurerm_ai_foundry.ai_foundry will be updated in-place
  ~ resource "azurerm_ai_foundry" "ai_foundry" {
        id                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.MachineLearningServices/workspaces/dlrm-ingest-ai-foundry-sbox"
        name                           = "dlrm-ingest-ai-foundry-sbox"
      ~ tags                           = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2025-04-08"
        } -> (known after apply)
        # (13 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ai.azurerm_cognitive_account.cognitive_account will be updated in-place
  ~ resource "azurerm_cognitive_account" "cognitive_account" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.CognitiveServices/accounts/dlrm-ingest-cognitive-account-sbox"
        name                               = "dlrm-ingest-cognitive-account-sbox"
      ~ tags                               = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2025-04-08"
        } -> (known after apply)
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ai.azurerm_machine_learning_workspace.ml_workspace will be updated in-place
  ~ resource "azurerm_machine_learning_workspace" "ml_workspace" {
        id                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.MachineLearningServices/workspaces/dlrm-ingest-ml-workspace-sbox"
        name                           = "dlrm-ingest-ml-workspace-sbox"
      ~ tags                           = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2025-04-08"
        } -> (known after apply)
        # (17 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ai.azurerm_role_assignment.blob_reader_from_ai_foundry will be created
  + resource "azurerm_role_assignment" "blob_reader_from_ai_foundry" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "74aea43c-93df-4c30-839f-1436b6aed5a3"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.Storage/storageAccounts/dlrmingestaisasbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.ai.azurerm_role_assignment.blob_reader_from_ml_workspace will be created
  + resource "azurerm_role_assignment" "blob_reader_from_ml_workspace" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e0dfe660-483a-40d1-aa4d-6e5973f1faa6"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.Storage/storageAccounts/dlrmingestaisasbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.application_insights.azurerm_application_insights.this will be updated in-place
  ~ resource "azurerm_application_insights" "this" {
        id                                    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.Insights/components/dlrm-ingest-ai-appinsights-sbox"
        name                                  = "dlrm-ingest-ai-appinsights-sbox"
      ~ tags                                  = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2025-04-08"
        } -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.application_insights.azurerm_monitor_activity_log_alert.main[0] will be updated in-place
  ~ resource "azurerm_monitor_activity_log_alert" "main" {
        id                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.Insights/activityLogAlerts/Application Insights daily cap reached - dlrm-ingest-ai-appinsights-sbox"
        name                = "Application Insights daily cap reached - dlrm-ingest-ai-appinsights-sbox"
      ~ tags                = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2025-04-08"
        } -> (known after apply)
        # (5 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.key_vault.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.KeyVault/vaults/dlrm-ingest-ai-kv-sbox"
        name                            = "dlrm-ingest-ai-kv-sbox"
      ~ tags                            = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2025-04-08"
        } -> (known after apply)
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.key_vault.azurerm_key_vault_access_policy.implicit_managed_identity_access_policy[0] will be created
  + resource "azurerm_key_vault_access_policy" "implicit_managed_identity_access_policy" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.KeyVault/vaults/dlrm-ingest-ai-kv-sbox"
      + object_id               = (known after apply)
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.key_vault.azurerm_user_assigned_identity.managed_identity[0] will be created
  + resource "azurerm_user_assigned_identity" "managed_identity" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "dlrm-ingest-sbox-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "managed-identities-sbox-rg"
      + tags                = (known after apply)
      + tenant_id           = (known after apply)
    }

  # module.storage.azurerm_private_endpoint.this[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.Network/privateEndpoints/dlrmingestaisasbox"
        name                          = "dlrmingestaisasbox"
      ~ tags                          = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2025-04-08"
        } -> (known after apply)
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.storage.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.Storage/storageAccounts/dlrmingestaisasbox"
        name                               = "dlrmingestaisasbox"
      ~ tags                               = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2025-04-08"
        } -> (known after apply)
        # (96 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 6 to add, 9 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":67,"Program":"tfcmt","SHA1":"","Target":"sbox_ai - TerraformPlanApply","Vars":{}} -->